OpenFOAM/foam9tutorials/tutorials/heatTransfer/chtMultiRegionFoam/shellAndTubeHeatExchanger/0/shell/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       volScalarField;
    location    "0/shell";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    lower
    {
        type            calculated;
        value           $internalField;
    }
    upper
    {
        type            calculated;
        value           $internalField;
    }
    wall
    {
        type            nutkWallFunction;
        value           $internalField;
    }
}


// ************************************************************************* //
